{
    "en": {
      "privacy_policy_body":
      "\nEffective Date: May 13, 2025\n\nWelcome to Arithmetic Training. This 3D application is developed and operated by yt-Studio (“we,” “us,” or “our”). We respect your privacy and are committed to protecting your personal information. This Privacy Policy explains how we collect, use, and share information when you use our Arithmetic Training application on Meta Quest.\n\n1. Information We Collect\nInformation You Provide Directly\nArithmetic Training does not require user registration, so we do not collect personally identifiable information (PII) such as your name, email address, or contact details.\n\nDevice Information\nWe may collect non-personally identifiable device information such as:\n･Device model\n･Operating system version\n･Connection status\nThis information is collected solely to ensure functionality and performance of the application.\n\nApplication Usage Data\nWe do not collect any application usage data that can be used to identify individuals.\n\n2. How We Use Information\nWe use collected information for the following purposes:\n･To provide, maintain, and improve Arithmetic Training (e.g., bug fixes, performance enhancements).\n･To respond to user support requests and resolve technical issues.\n･To send important notifications about the app (e.g., updates, policy changes).\n\n3. Sharing of Information\nWe do not sell or rent your personal information to third parties.\nWe may share non-personally identifiable information with service providers only as necessary to operate and maintain the app’s functionality.\n\n4. Information Security\nWe implement reasonable and appropriate technical and organizational measures to protect your information from unauthorized access, disclosure, or misuse. However, no method of transmission over the Internet is 100% secure.\n\n5. Your Rights and Choices\nYou have the right to:\n･Access the data we may have collected (if any)\n･Request correction of inaccurate data\n･Request deletion of your data\nTo request access, correction, or deletion of your data, please contact us at the email address provided below. We will respond within 30 days in accordance with applicable privacy laws.\n\n6. Data Deletion Process\nIf you would like us to delete any data that may have been collected through the Arithmetic Training application, please email us at:yuki22683@gmail.com\nInclude the subject line: Data Deletion Request - Arithmetic Training\nPlease describe your request and any identifying information necessary to locate your data (if any).\n\nNote: Since we do not collect PII by default, we may not be able to associate data with specific users, but we will make every effort to accommodate your request.\n\n7. Children’s Privacy\nArithmetic Training is not intended for children under 13 years of age. We do not knowingly collect personal information from children. If you believe a child’s information has been collected unintentionally, please contact us immediately and we will delete such information.\n\n8. Changes to This Privacy Policy\nWe may update this Privacy Policy from time to time. The most current version will always be available within the app and on our website. Any material changes will be communicated through app updates or notifications.\n\n9. Contact Us\nIf you have any questions or concerns about this Privacy Policy or our data practices, pleas=ail: yuki22683@gmail.com\n\nBy using Arithmetic Training, you agree to the terms outlined in this Privacy Policy. Thank you for choosing our app!"
    },
    "ja": {
      "privacy_policy_body":
      "\n発効日：2025年5月13日\n\n計算トレーニングへようこそ\nこの3Dアプリケーションは、yt-Studio（「私たち」、「当社」、または「弊社」）によって開発および運営されています。私たちはあなたのプライバシーを尊重し、個人情報の保護に取り組んでいます。このプライバシーポリシーは、Meta Questで提供される計算トレーニングアプリケーションを使用する際の情報の収集、使用、共有方法について説明します。\n\n1. 収集する情報\n直接提供される情報\n計算トレーニングではユーザー登録が不要なため、氏名、メールアドレス、連絡先などの個人を特定できる情報（PII）は収集しません。\n\nデバイス情報\n以下のような非個人を特定するデバイス情報を収集する場合があります：\n･デバイスモデル\n･オペレーティングシステムのバージョン\n･接続状況\nこれらの情報は、アプリケーションの機能とパフォーマンスを確保するためにのみ収集されます。\n\nアプリケーション使用データ\n個人を特定できるアプリケーション使用データは収集しません。\n\n2. 情報の使用方法\n収集した情報は以下の目的で使用されます：\n･計算トレーニングの提供、維持、改善（例：バグ修正、パフォーマンス向上）。\n･ユーザーサポートの対応や技術的問題の解決。\n･アプリに関する重要な通知の送信（例：アップデート、ポリシー変更）。\n\n3. 情報の共有\n当社はあなたの個人情報を第三者に販売または貸与しません。\nアプリの機能運営に必要な場合に限り、非個人を特定する情報をサービスプロバイダーと共有することがあります。\n\n4. 情報セキュリティ\n当社は、情報の不正アクセス、開示、または誤使用を防ぐため、合理的かつ適切な技術的・組織的措置を講じています。ただし、インターネットを介した送信方法は100%安全ではありません。\n\n5. あなたの権利と選択肢\nあなたには以下の権利があります：\n･当社が収集したデータ（もしあれば）へのアクセス\n･不正確なデータの修正依頼\n･データの削除依頼\nデータへのアクセス、修正、または削除を希望する場合は、以下に記載のメールアドレスまでご連絡ください。適用されるプライバシー法に従い、30日以内に回答します。\n\n6. データ削除プロセス\n計算トレーニングアプリケーションを通じて収集されたデータを削除したい場合は、以下のメールアドレスまでご連絡ください：\nメールアドレス: yuki22683@gmail.com\n件名: データ削除依頼 - 計算トレーニング\nリクエスト内容およびデータ特定に必要な情報（もしあれば）を記載してください。\n注: 当社はデフォルトでPIIを収集しないため、特定のユーザーに関連するデータを特定できない場合がありますが、リクエストに対応するために最善を尽くします。\n\n7. 子供のプライバシー\n計算トレーニングは13歳未満の子供を対象としていません。子供の個人情報を意図的に収集することはありません。子供の情報が意図せず収集されたと思われる場合は、すぐにご連絡ください。その情報を削除します。\n\n8. プライバシーポリシーの変更\nこのプライバシーポリシーは随時更新されることがあります。最新版は常にアプリ内および当社ウェブサイトで確認できます。重要な変更がある場合は、アプリのアップデートまたは通知を通じてお知らせします。\n\n9. お問い合わせ\nこのプライバシーポリシーまたは当社のデータ処理に関する質問や懸念がある場合は、以下までご連絡ください：\nメール: yuki22683@gmail.com\n\n計算トレーニングを使用することで、このプライバシーポリシーに記載された条件に同意したものとみなされます。当社のアプリをご利用いただきありがとう！"
    },
    "cs": {
      "privacy_policy_body":
      "\nDatum účinnosti: 13. května 2025\n\nVítejte v Aritmetickém tréninku. Tato 3D aplikace je vyvíjena a provozována společností yt-Studio („my“, „nás“ nebo „naše“). Respektujeme vaše soukromí a zavazujeme se chránit vaše osobní údaje. Tato Zásady ochrany osobních údajů vysvětlují, jak shromažďujeme, používáme a sdílíme informace, když používáte naši aplikaci Aritmetický trénink na zařízení Meta Quest.\n\n1. Informace, které shromažďujeme\nInformace, které poskytujete přímo\nAritmetický trénink nevyžaduje registraci uživatelů, a proto neshromažďujeme osobní údaje (PII), jako je vaše jméno, e-mailová adresa nebo kontaktní údaje.\nInformace o zařízení\nMůžeme shromažďovat neosobní údaje o zařízení, jako například:\n･ Model zařízení\n･ Verze operačního systému\n･ Stav připojení\nTyto informace shromažďujeme výhradně za účelem zajištění funkčnosti a výkonu aplikace.\nÚdaje o používání aplikace\nNeshromažďujeme žádné údaje o používání aplikace, které by mohly být použity k identifikaci jednotlivců.\n\n2. Jak používáme informace\nShromážděné informace používáme k následujícím účelům:\n･ K poskytování, údržbě a zlepšování Aritmetického tréninku (např. opravy chyb, vylepšení výkonu).\n･ K odpovídání na požadavky uživatelské podpory a řešení technických problémů.\n･ K odesílání důležitých oznámení o aplikaci (např. aktualizace, změny zásad).\n\n3. Sdílení informací\nVaše osobní údaje neprodáváme ani nepronajímáme třetím stranám.\nNeosobní údaje můžeme sdílet s poskytovateli služeb pouze v nezbytném rozsahu pro provoz a údržbu funkcí aplikace.\n\n4. Bezpečnost informací\nZavádíme přiměřené a vhodné technické a organizační opatření k ochraně vašich informací před neoprávněným přístupem, zveřejněním nebo zneužitím. Žádný způsob přenosu přes internet však není 100% bezpečný.\n\n5. Vaše práva a možnosti\nMáte právo:\n･ Přistupovat k údajům, které jsme případně shromáždili.\n･ Požadovat opravu nepřesných údajů.\n･ Požadovat vymazání vašich údajů.\nPro požadavek na přístup, opravu nebo vymazání vašich údajů nás kontaktujte na e-mailové adrese uvedené níže. Odpovíme do 30 dnů v souladu s platnými zákony o ochraně osobních údajů.\n\n6. Proces vymazání údajů\nPokud si přejete, abychom vymazali jakékoli údaje, které mohly být shromážděny prostřednictvím aplikace Aritmetický trénink, kontaktujte nás na e-mailu: yuki22683@gmail.com (mailto:yuki22683@gmail.com)\nDo předmětu e-mailu uveďte: Žádost o vymazání údajů - Aritmetický trénink\nPopište svůj požadavek a uveďte jakékoli identifikační informace potřebné k nalezení vašich údajů (pokud existují).\nPoznámka: Vzhledem k tomu, že ve výchozím nastavení neshromažďujeme osobní údaje, nemusíme být schopni přiřadit údaje ke konkrétním uživatelům, ale vynaložíme veškeré úsilí, abychom vašemu požadavku vyhověli.\n\n7. Ochrana soukromí dětí\nAritmetický trénink není určen dětem mladším 13 let. Vědomě neshromažďujeme osobní údaje od dětí. Pokud se domníváte, že byly údaje dítěte shromážděny neúmyslně, kontaktujte nás okamžitě a tyto údaje vymažeme.\n\n8. Změny těchto Zásad ochrany osobních údajů\nTyto Zásady ochrany osobních údajů můžeme čas od času aktualizovat. Nejaktuálnější verze bude vždy k dispozici v aplikaci a na našem webu. O jakýchkoli podstatných změnách vás budeme informovat prostřednictvím aktualizací aplikace nebo oznámení.\n\n9. Kontaktujte nás\nPokud máte jakékoli dotazy nebo obavy týkající se těchto Zásad ochrany osobních údajů nebo našich postupů zpracování údajů, kontaktujte nás:\nE-mail: yuki22683@gmail.com\n\nPoužíváním Aritmetického tréninku souhlasíte s podmínkami uvedenými v těchto Zásadách ochrany osobních údajů. Děkujeme, že jste si vybrali naši aplikaci!"
    },
    "de": {
      "privacy_policy_body":
      "\nGültigkeitsdatum: 13. Mai 2025\n\nWillkommen bei Arithmetic Training. Diese 3D-Anwendung wird von yt-Studio („wir“, „uns“ oder „unser“) entwickelt und betrieben. Wir respektieren Ihre Privatsphäre und sind bestrebt, Ihre persönlichen Daten zu schützen. Diese Datenschutzrichtlinie erläutert, wie wir Informationen sammeln, verwenden und weitergeben, wenn Sie unsere Arithmetic Training-Anwendung auf Meta Quest nutzen.\n\n1. Informationen, die wir sammeln\nDirekt von Ihnen bereitgestellte Informationen\nArithmetic Training erfordert keine Benutzerregistrierung, daher sammeln wir keine personenbezogenen Daten (PII) wie Ihren Namen, Ihre E-Mail-Adresse oder Kontaktdaten.\nGeräteinformationen\nWir können nicht-personenbezogene Geräteinformationen sammeln, wie z. B.:\n･Gerätemodell\n･Betriebssystemversion\n･Verbindungsstatus\nDiese Informationen werden ausschließlich zur Sicherstellung der Funktionalität und Leistung der Anwendung gesammelt.\nNutzungsdaten der Anwendung\nWir sammeln keine Nutzungsdaten der Anwendung, die zur Identifizierung von Personen verwendet werden können.\n\n2. Wie wir Informationen verwenden\nWir verwenden die gesammelten Informationen für folgende Zwecke:\n･Bereitstellung, Wartung und Verbesserung von Arithmetic Training (z. B. Fehlerbehebungen, Leistungsverbesserungen).\n･Beantwortung von Supportanfragen und Lösung technischer Probleme.\n･Versand wichtiger Benachrichtigungen über die App (z. B. Updates, Änderungen der Richtlinien).\n\n3. Weitergabe von Informationen\nWir verkaufen oder vermieten Ihre persönlichen Daten nicht an Dritte.\nWir können nicht-personenbezogene Informationen mit Dienstleistern teilen, soweit dies für den Betrieb und die Wartung der Funktionalität der App erforderlich ist.\n\n4. Informationssicherheit\nWir setzen angemessene und geeignete technische und organisatorische Maßnahmen ein, um Ihre Daten vor unbefugtem Zugriff, Offenlegung oder Missbrauch zu schützen. Keine Übertragungsmethode über das Internet ist jedoch zu 100 % sicher.\n\n5. Ihre Rechte und Wahlmöglichkeiten\nSie haben das Recht:\n･Auf die von uns möglicherweise gesammelten Daten (falls vorhanden) zuzugreifen.\n･Die Berichtigung ungenauer Daten zu verlangen.\n･Die Löschung Ihrer Daten zu verlangen.\nUm Zugriff, Berichtigung oder Löschung Ihrer Daten zu beantragen, kontaktieren Sie uns bitte unter der unten angegebenen E-Mail-Adresse. Wir werden innerhalb von 30 Tagen gemäß den geltenden Datenschutzgesetzen antworten.\n\n6. Datenlöschungsprozess\nWenn Sie möchten, dass wir Daten löschen, die möglicherweise über die Arithmetic Training-Anwendung gesammelt wurden, senden Sie uns bitte eine E-Mail an: yuki22683@gmail.com\nBetreffzeile: Antrag auf Datenlöschung - Arithmetic Training\nBitte beschreiben Sie Ihren Antrag und geben Sie alle notwendigen Informationen an, um Ihre Daten (falls vorhanden) zu finden.\nHinweis: Da wir standardmäßig keine personenbezogenen Daten sammeln, können wir Daten möglicherweise nicht bestimmten Nutzern zuordnen, aber wir werden uns bemühen, Ihrem Antrag nachzukommen.\n\n7. Datenschutz von Kindern\nArithmetic Training ist nicht für Kinder unter 13 Jahren gedacht. Wir sammeln wissentlich keine persönlichen Daten von Kindern. Wenn Sie glauben, dass die Daten eines Kindes unbeabsichtigt gesammelt wurden, kontaktieren Sie uns bitte umgehend, und wir werden diese Daten löschen.\n\n8. Änderungen an dieser Datenschutzrichtlinie\nWir können diese Datenschutzrichtlinie von Zeit zu Zeit aktualisieren. Die aktuellste Version ist stets in der App und auf unserer Website verfügbar. Wesentliche Änderungen werden über App-Updates oder Benachrichtigungen mitgeteilt.\n\n9. Kontaktieren Sie uns\nWenn Sie Fragen oder Bedenken zu dieser Datenschutzrichtlinie oder unseren Datenschutzpraktiken haben, kontaktieren Sie uns bitte:\nE-Mail: yuki22683@gmail.com\n\nDurch die Nutzung von Arithmetic Training stimmen Sie den in dieser Datenschutzrichtlinie beschriebenen Bedingungen zu. Vielen Dank, dass Sie unsere App nutzen!"
    },
    "nl": {
      "privacy_policy_body":
      "\nEffectieve Datum: 13 mei 2025\n\nWelkom bij Arithmetic Training\nDeze 3D-applicatie wordt ontwikkeld en beheerd door yt-Studio (“wij,” “ons,” of “onze”). Wij respecteren uw privacy en zetten ons in om uw persoonlijke informatie te beschermen. Dit Privacybeleid legt uit hoe wij informatie verzamelen, gebruiken en delen wanneer u onze Arithmetic Training-applicatie gebruikt op Meta Quest.\n\n1. Informatie die wij verzamelen\nInformatie die u direct verstrekt\nArithmetic Training vereist geen gebruikersregistratie, dus wij verzamelen geen persoonlijk identificeerbare informatie (PII) zoals uw naam, e-mailadres of contactgegevens.\nApparaatgegevens\nWij kunnen niet-persoonlijk identificeerbare apparaatgegevens verzamelen, zoals:\n･Apparaatmodel\n･Versie van het besturingssysteem\n･Verbindingsstatus\nDeze informatie wordt uitsluitend verzameld om de functionaliteit en prestaties van de applicatie te waarborgen.\nGebruiksgegevens van de applicatie\nWij verzamelen geen gebruiksgegevens van de applicatie die kunnen worden gebruikt om individuen te identificeren.\n\n2. Hoe wij informatie gebruiken\nWij gebruiken verzamelde informatie voor de volgende doeleinden:\n･Het leveren, onderhouden en verbeteren van Arithmetic Training (bijv. bugfixes, prestatieverbeteringen).\n･Het beantwoorden van ondersteuningsverzoeken van gebruikers en het oplossen van technische problemen.\n･Het verzenden van belangrijke meldingen over de app (bijv. updates, wijzigingen in het beleid).\n\n3. Delen van informatie\nWij verkopen of verhuren uw persoonlijke informatie niet aan derden.\nWij kunnen niet-persoonlijk identificeerbare informatie delen met dienstverleners alleen indien nodig om de functionaliteit van de app te beheren en te onderhouden.\n\n4. Informatiebeveiliging\nWij implementeren redelijke en passende technische en organisatorische maatregelen om uw informatie te beschermen tegen ongeoorloofde toegang, openbaarmaking of misbruik. Geen enkele methode van verzending via het internet is echter 100% veilig.\n\n5. Uw rechten en keuzes\nU heeft het recht om:\n･Toegang te krijgen tot de gegevens die wij mogelijk hebben verzameld (indien aanwezig).\n･Correctie van onjuiste gegevens te verzoeken.\n･Verwijdering van uw gegevens te verzoeken.\nOm toegang, correctie of verwijdering van uw gegevens te verzoeken, neem contact met ons op via het onderstaande e-mailadres. Wij zullen binnen 30 dagen reageren in overeenstemming met de toepasselijke privacywetten.\n\n6. Gegevensverwijderingsproces\nAls u wilt dat wij gegevens verwijderen die mogelijk zijn verzameld via de Arithmetic Training-applicatie, stuur ons dan een e-mail naar: yuki22683@gmail.com (mailto:yuki22683@gmail.com)\nGebruik als onderwerp: Verzoek tot Gegevensverwijdering - Arithmetic Training\nBeschrijf uw verzoek en vermeld alle identificerende informatie die nodig is om uw gegevens te lokaliseren (indien aanwezig).\nLet op: Omdat wij standaard geen PII verzamelen, kunnen wij mogelijk geen gegevens aan specifieke gebruikers koppelen, maar wij zullen ons uiterste best doen om aan uw verzoek te voldoen.\n\n7. Privacy van kinderen\nArithmetic Training is niet bedoeld voor kinderen jonger dan 13 jaar. Wij verzamelen niet bewust persoonlijke informatie van kinderen. Als u denkt dat de informatie van een kind onbedoeld is verzameld, neem dan onmiddellijk contact met ons op, en wij zullen deze informatie verwijderen.\n\n8. Wijzigingen in dit Privacybeleid\nWij kunnen dit Privacybeleid van tijd tot tijd bijwerken. De meest recente versie is altijd beschikbaar in de app en op onze website. Materiële wijzigingen worden gecommuniceerd via app-updates of meldingen.\n\n9. Contact met ons opnemen\nAls u vragen of zorgen heeft over dit Privacybeleid of onze gegevenspraktijken, neem dan contact met ons op:\nE-mail: yuki22683@gmail.com\n\nDoor Arithmetic Training te gebruiken, gaat u akkoord met de voorwaarden zoals uiteengezet in dit Privacybeleid. Bedankt voor het kiezen van onze app!"
    },
    "da": {
      "privacy_policy_body":
      "\nEffektiv dato: 13. maj 2025\n\nVelkommen til Arithmetic Training. Denne 3D-applikation er udviklet og drives af yt-Studio ( \"vi \",  \"os \" eller  \"vores \"). Vi respekterer dit privatliv og er forpligtet til at beskytte dine personlige oplysninger. Denne fortrolighedspolitik forklarer, hvordan vi indsamler, bruger og deler oplysninger, når du bruger vores Arithmetic Training-applikation på Meta Quest.\n\n1. Oplysninger, vi indsamler\nOplysninger, du direkte giver\nArithmetic Training kræver ikke brugerregistrering, så vi indsamler ikke personligt identificerbare oplysninger (PII) såsom dit navn, e-mailadresse eller kontaktoplysninger.\nEnhedsoplysninger\nVi kan indsamle ikke-personligt identificerbare enhedsoplysninger såsom:\n･ Enhedsmodel\n･ Operativsystemversion\n･ Forbindelsesstatus\nDisse oplysninger indsamles udelukkende for at sikre applikationens funktionalitet og ydeevne.\nData om applikationsbrug\nVi indsamler ikke nogen data om applikationsbrug, der kan bruges til at identificere enkeltpersoner.\n\n2. Hvordan vi bruger oplysninger\nVi bruger indsamlede oplysninger til følgende formål:\n･ At levere, vedligeholde og forbedre Arithmetic Training (f.eks. fejlrettelser, ydeevneforbedringer).\n･ At besvare brugerforespørgsler om support og løse tekniske problemer.\n･ At sende vigtige meddelelser om appen (f.eks. opdateringer, ændringer i politikker).\n\n3. Deling af oplysninger\nVi sælger eller udlejer ikke dine personlige oplysninger til tredjeparter.\nVi kan dele ikke-personligt identificerbare oplysninger med tjenesteudbydere, men kun i det omfang, det er nødvendigt for at drive og vedligeholde appens funktionalitet.\n\n4. Informationssikkerhed\nVi implementerer rimelige og passende tekniske og organisatoriske foranstaltninger for at beskytte dine oplysninger mod uautoriseret adgang, videregivelse eller misbrug. Ingen metode til transmission over internettet er dog 100 % sikker.\n\n5. Dine rettigheder og valgmuligheder\nDu har ret til:\n･ At få adgang til de data, vi måtte have indsamlet (hvis nogen).\n･ At anmode om rettelse af unøjagtige data.\n･ At anmode om sletning af dine data.\nFor at anmode om adgang, rettelse eller sletning af dine data, bedes du kontakte os på den e-mailadresse, der er angivet nedenfor. Vi vil svare inden for 30 dage i overensstemmelse med gældende databeskyttelseslove.\n\n6. Proces for sletning af data\nHvis du ønsker, at vi sletter eventuelle data, der måtte være blevet indsamlet gennem Arithmetic Training-applikationen, bedes du sende en e-mail til: yuki22683@gmail.com\nInkluder emnelinjen: Anmodning om sletning af data - Arithmetic Training\nBeskriv venligst din anmodning og eventuelle identificerende oplysninger, der er nødvendige for at finde dine data (hvis nogen).\nBemærk: Da vi som udgangspunkt ikke indsamler PII, kan vi muligvis ikke knytte data til specifikke brugere, men vi vil gøre alt for at imødekomme din anmodning.\n\n7. Børns privatliv\nArithmetic Training er ikke beregnet til børn under 13 år. Vi indsamler ikke bevidst personlige oplysninger fra børn. Hvis du mener, at et barns oplysninger er blevet indsamlet utilsigtet, bedes du kontakte os øjeblikkeligt, og vi vil slette sådanne oplysninger.\n\n8. Ændringer i denne fortrolighedspolitik\nVi kan opdatere denne fortrolighedspolitik fra tid til anden. Den mest aktuelle version vil altid være tilgængelig i appen og på vores hjemmeside. Eventuelle væsentlige ændringer vil blive kommunikeret gennem appopdateringer eller meddelelser.\n\n9. Kontakt os\nHvis du har spørgsmål eller bekymringer vedrørende denne fortrolighedspolitik eller vores datapraksis, bedes du kontakte os:\nE-mail: yuki22683@gmail.com\n\nVed at bruge Arithmetic Training accepterer du de vilkår, der er beskrevet i denne fortrolighedspolitik. Tak for, at du vælger vores app!"
    },
    "el": {
      "privacy_policy_body":
      "\nΗμερομηνία Ενεργοποίησης: 13 Μαΐου 2025\n\nΚαλώς ήρθατε στην Εφαρμογή Αριθμητικής Εκπαίδευσης. Αυτή η τρισδιάστατη εφαρμογή αναπτύσσεται και λειτουργεί από την yt-Studio («εμείς», «μας» ή «μας»). Σεβόμαστε την ιδιωτικότητά σας και δεσμευόμαστε να προστατεύουμε τις προσωπικές σας πληροφορίες. Η παρούσα Πολιτική Απορρήτου εξηγεί πώς συλλέγουμε, χρησιμοποιούμε και μοιραζόμαστε πληροφορίες όταν χρησιμοποιείτε την εφαρμογή Αριθμητικής Εκπαίδευσης στο Meta Quest.\n\n1. Πληροφορίες που Συλλέγουμε\nΠληροφορίες που Παρέχετε Απευθείας\nΗ Αριθμητική Εκπαίδευση δεν απαιτεί εγγραφή χρήστη, επομένως δεν συλλέγουμε προσωπικά αναγνωρίσιμες πληροφορίες (PII) όπως το όνομά σας, τη διεύθυνση email σας ή τα στοιχεία επικοινωνίας σας.\nΠληροφορίες Συσκευής\nΜπορεί να συλλέξουμε μη προσωπικά αναγνωρίσιμες πληροφορίες συσκευής, όπως:\n･ Μοντέλο συσκευής\n･ Έκδοση λειτουργικού συστήματος\n･ Κατάσταση σύνδεσης\nΑυτές οι πληροφορίες συλλέγονται αποκλειστικά για τη διασφάλιση της λειτουργικότητας και της απόδοσης της εφαρμογής.\nΔεδομένα Χρήσης Εφαρμογής\nΔεν συλλέγουμε δεδομένα χρήσης εφαρμογής που μπορούν να χρησιμοποιηθούν για την ταυτοποίηση ατόμων.\n\n2. Πώς Χρησιμοποιούμε τις Πληροφορίες\nΧρησιμοποιούμε τις συλλεγμένες πληροφορίες για τους εξής σκοπούς:\n･ Για την παροχή, τη συντήρηση και τη βελτίωση της Αριθμητικής Εκπαίδευσης (π.χ. διορθώσεις σφαλμάτων, βελτιώσεις απόδοσης).\n･ Για την ανταπόκριση σε αιτήματα υποστήριξης χρηστών και την επίλυση τεχνικών προβλημάτων.\n･ Για την αποστολή σημαντικών ειδοποιήσεων σχετικά με την εφαρμογή (π.χ. ενημερώσεις, αλλαγές πολιτικής).\n\n3. Κοινοποίηση Πληροφοριών\nΔεν πωλούμε ούτε ενοικιάζουμε τις προσωπικές σας πληροφορίες σε τρίτους.\nΜπορεί να μοιραστούμε μη προσωπικά αναγνωρίσιμες πληροφορίες με παρόχους υπηρεσιών μόνο όσο είναι απαραίτητο για τη λειτουργία και τη συντήρηση της εφαρμογής.\n\n4. Ασφάλεια Πληροφοριών\nΕφαρμόζουμε εύλογα και κατάλληλα τεχνικά και οργανωτικά μέτρα για την προστασία των πληροφοριών σας από μη εξουσιοδοτημένη πρόσβαση, αποκάλυψη ή κακή χρήση. Ωστόσο, καμία μέθοδος μετάδοσης μέσω του Διαδικτύου δεν είναι 100% ασφαλής.\n\n5. Τα Δικαιώματά σας και οι Επιλογές σας\nΈχετε το δικαίωμα να:\n･ Προσπελάσετε τα δεδομένα που ενδέχεται να έχουμε συλλέξει (εάν υπάρχουν).\n･ Ζητήσετε τη διόρθωση ανακριβών δεδομένων.\n･ Ζητήσετε τη διαγραφή των δεδομένων σας.\nΓια να ζητήσετε πρόσβαση, διόρθωση ή διαγραφή των δεδομένων σας, παρακαλούμε επικοινωνήστε μαζί μας στη διεύθυνση email που παρέχεται παρακάτω. Θα απαντήσουμε εντός 30 ημερών σύμφωνα με την ισχύουσα νομοθεσία περί απορρήτου.\n\n6. Διαδικασία Διαγραφής Δεδομένων\nΕάν επιθυμείτε να διαγράψουμε οποιαδήποτε δεδομένα που ενδέχεται να έχουν συλλεχθεί μέσω της εφαρμογής Αριθμητικής Εκπαίδευσης, παρακαλούμε στείλτε μας email στη διεύθυνση: yuki22683@gmail.com\nΣυμπεριλάβετε τη γραμμή θέματος: Αίτημα Διαγραφής Δεδομένων - Αριθμητική Εκπαίδευση\nΠαρακαλούμε περιγράψτε το αίτημά σας και οποιαδήποτε πληροφορία ταυτοποίησης είναι απαραίτητη για τον εντοπισμό των δεδομένων σας (εάν υπάρχουν).\nΣημείωση: Επειδή δεν συλλέγουμε PII από προεπιλογή, ενδέχεται να μην μπορούμε να συσχετίσουμε δεδομένα με συγκεκριμένους χρήστες, αλλά θα καταβάλουμε κάθε προσπάθεια για να ικανοποιήσουμε το αίτημά σας.\n\n7. Προστασία της Ιδιωτικότητας των Παιδιών\nΗ Αριθμητική Εκπαίδευση δεν προορίζεται για παιδιά κάτω των 13 ετών. Δεν συλλέγουμε εν γνώσει μας προσωπικές πληροφορίες από παιδιά. Εάν πιστεύετε ότι πληροφορίες παιδιού έχουν συλλεχθεί ακούσια, παρακαλούμε επικοινωνήστε μαζί μας αμέσως και θα διαγράψουμε αυτές τις πληροφορίες.\n\n8. Αλλαγές στην Πολιτική Απορρήτου\nΕνδέχεται να ενημερώνουμε την παρούσα Πολιτική Απορρήτου από καιρό σε καιρό. Η πιο πρόσφατη έκδοση θα είναι πάντα διαθέσιμη εντός της εφαρμογής και στον ιστότοπό μας. Οποιεσδήποτε ουσιαστικές αλλαγές θα κοινοποιούνται μέσω ενημερώσεων της εφαρμογής ή ειδοποιήσεων.\n\n9. Επικοινωνήστε μαζί μας\nΕάν έχετε οποιεσδήποτε ερωτήσεις ή ανησυχίες σχετικά με την παρούσα Πολιτική Απορρήτου ή τις πρακτικές μας για τα δεδομένα, παρακαλούμε επικοινωνήστε μαζί μας:\nEmail: yuki22683@gmail.com\n\nΜε τη χρήση της Αριθμητικής Εκπαίδευσης, συμφωνείτε με τους όρους που περιγράφονται στην παρούσα Πολιτική Απορρήτου. Σας ευχαριστούμε που επιλέξατε την εφαρμογή μας!"
    },
    "fi": {
      "privacy_policy_body":
      "\nVoimaantulopäivä: 13. toukokuuta 2025\n\nTervetuloa Arithmetic Training -sovellukseen. Tämä 3D-sovellus on kehitetty ja sitä operoi yt-Studio (“me”, “meitä” tai “meidän”). Kunnioitamme yksityisyyttäsi ja olemme sitoutuneet suojelemaan henkilötietojasi. Tämä tietosuojaseloste selittää, miten keräämme, käytämme ja jaamme tietoja, kun käytät Arithmetic Training -sovellustamme Meta Quest -alustalla.\n\n1. Keräämämme tiedot\nSuoraan antamasi tiedot\nArithmetic Training ei vaadi käyttäjärekisteröitymistä, joten emme kerää henkilötietoja (PII), kuten nimeäsi, sähköpostiosoitettasi tai yhteystietojasi.\nLaitetiedot\nVoimme kerätä ei-henkilökohtaisia laitetietoja, kuten:\n･Laitteen malli\n･Käyttöjärjestelmän versio\n･Yhteyden tila\nNämä tiedot kerätään yksinomaan sovelluksen toimivuuden ja suorituskyvyn varmistamiseksi.\nSovelluksen käyttödata\nEmme kerää mitään sovelluksen käyttödataa, jota voidaan käyttää yksittäisten henkilöiden tunnistamiseen.\n\n2. Kuinka käytämme tietoja\nKäytämme kerättyjä tietoja seuraaviin tarkoituksiin:\n･Arithmetic Training -sovelluksen tarjoamiseen, ylläpitoon ja parantamiseen (esim. virhekorjaukset, suorituskyvyn parannukset).\n･Käyttäjätukipyyntöihin vastaamiseen ja teknisten ongelmien ratkaisemiseen.\n･Tärkeiden ilmoitusten lähettämiseen sovelluksesta (esim. päivitykset, käytäntömuutokset).\n\n3. Tietojen jakaminen\nEmme myy tai vuokraa henkilötietojasi kolmansille osapuolille.\nVoimme jakaa ei-henkilökohtaisia tietoja palveluntarjoajien kanssa vain sovelluksen toiminnan ja ylläpidon kannalta välttämättömissä tapauksissa.\n\n4. Tietoturva\nToteutamme kohtuullisia ja asianmukaisia teknisiä ja organisatorisia toimenpiteitä suojataksemme tietojasi luvattomalta pääsyltä, paljastamiselta tai väärinkäytöltä. Mikään internetin kautta tapahtuva tiedonsiirto ei kuitenkaan ole 100 % turvallista.\n\n5. Oikeutesi ja valintasi\nSinulla on oikeus:\n･Päästä käsiksi keräämiimme tietoihin (jos sellaisia on).\n･Pyytää virheellisten tietojen korjaamista.\n･Pyytää tietojesi poistamista.\nJos haluat pyytää pääsyä tietoihisi, niiden korjaamista tai poistamista, ota meihin yhteyttä alla olevaan sähköpostiosoitteeseen. Vastaamme 30 päivän kuluessa sovellettavien tietosuojalakien mukaisesti.\n\n6. Tietojen poistoprosessi\nJos haluat, että poistamme Arithmetic Training -sovelluksen kautta mahdollisesti kerätyt tiedot, lähetä meille sähköpostia osoitteeseen: yuki22683@gmail.com (mailto:yuki22683@gmail.com)\nLisää aihekenttään: Data Deletion Request - Arithmetic Training\nKuvaile pyyntösi ja anna tarvittavat tunnistetiedot tietojesi paikantamiseksi (jos sellaisia on).\nHuomautus: Koska emme kerää henkilötietoja oletusarvoisesti, emme välttämättä pysty yhdistämään tietoja tiettyihin käyttäjiin, mutta teemme parhaamme toteuttaaksemme pyyntösi.\n\n7. Lasten yksityisyys\nArithmetic Training -sovellus ei ole tarkoitettu alle 13-vuotiaille lapsille. Emme tietoisesti kerää henkilötietoja lapsilta. Jos uskot, että lapsen tietoja on kerätty vahingossa, ota meihin välittömästi yhteyttä, niin poistamme kyseiset tiedot.\n\n8. Muutokset tähän tietosuojaselosteeseen\nVoimme päivittää tätä tietosuojaselostetta aika ajoin. Ajantasaisin versio on aina saatavilla sovelluksessa ja verkkosivustollamme. Merkittävistä muutoksista tiedotetaan sovelluspäivitysten tai ilmoitusten kautta.\n\n9. Ota yhteyttä\nJos sinulla on kysymyksiä tai huolenaiheita tästä tietosuojaselosteesta tai tietojenkäsittelykäytännöistämme, ota meihin yhteyttä:\nSähköposti: yuki22683@gmail.com\n\nKäyttämällä Arithmetic Training -sovellusta hyväksyt tässä tietosuojaselosteessa kuvatut ehdot. Kiitos, että valitsit sovelluksemme!"
    },
    "fr": {
      "privacy_policy_body":
      "\nDate d'entrée en vigueur : 13 mai 2025\n\nBienvenue dans Arithmetic Training. Cette application 3D est développée et exploitée par yt-Studio (« nous », « notre », ou « nos »). Nous respectons votre vie privée et nous engageons à protéger vos informations personnelles. Cette politique de confidentialité explique comment nous collectons, utilisons et partageons les informations lorsque vous utilisez notre application Arithmetic Training sur Meta Quest.\n\n1. Informations que nous collectons\nInformations fournies directement par vous\nArithmetic Training ne nécessite pas d'inscription des utilisateurs, nous ne collectons donc pas d'informations personnellement identifiables (PII) telles que votre nom, votre adresse e-mail ou vos coordonnées.\nInformations sur l'appareil\nNous pouvons collecter des informations non personnellement identifiables sur l'appareil, telles que :\n･Modèle de l'appareil\n･Version du système d'exploitation\n･État de la connexion\nCes informations sont collectées uniquement pour garantir le fonctionnement et les performances de l'application.\nDonnées d'utilisation de l'application\nNous ne collectons aucune donnée d'utilisation de l'application pouvant être utilisée pour identifier des individus.\n\n2. Comment nous utilisons les informations\nNous utilisons les informations collectées aux fins suivantes :\n･Fournir, maintenir et améliorer Arithmetic Training (par exemple, corrections de bugs, améliorations des performances).\n･Répondre aux demandes d'assistance des utilisateurs et résoudre les problèmes techniques.\n･Envoyer des notifications importantes concernant l'application (par exemple, mises à jour, changements de politique).\n\n3. Partage des informations\nNous ne vendons ni ne louons vos informations personnelles à des tiers.\nNous pouvons partager des informations non personnellement identifiables avec des prestataires de services uniquement si cela est nécessaire pour assurer le fonctionnement et la maintenance de l'application.\n\n4. Sécurité des informations\nNous mettons en œuvre des mesures techniques et organisationnelles raisonnables et appropriées pour protéger vos informations contre tout accès, divulgation ou utilisation non autorisés. Cependant, aucune méthode de transmission sur Internet n'est sécurisée à 100 %.\n\n5. Vos droits et choix\nVous avez le droit de :\n･Accéder aux données que nous avons pu collecter (le cas échéant).\n･Demander la correction de données inexactes.\n･Demander la suppression de vos données.\nPour demander l'accès, la correction ou la suppression de vos données, veuillez nous contacter à l'adresse e-mail indiquée ci-dessous. Nous répondrons dans un délai de 30 jours, conformément aux lois sur la protection des données applicables.\n\n6. Processus de suppression des données\nSi vous souhaitez que nous supprimions les données qui pourraient avoir été collectées via l'application Arithmetic Training, veuillez nous envoyer un e-mail à : yuki22683@gmail.com (mailto:yuki22683@gmail.com)\nIndiquez l'objet : Demande de suppression de données - Arithmetic Training\nVeuillez décrire votre demande et fournir toute information d'identification nécessaire pour localiser vos données (le cas échéant).\nRemarque : Étant donné que nous ne collectons pas de PII par défaut, il est possible que nous ne puissions pas associer des données à des utilisateurs spécifiques, mais nous ferons tout notre possible pour répondre à votre demande.\n\n7. Confidentialité des enfants\nArithmetic Training n'est pas destiné aux enfants de moins de 13 ans. Nous ne collectons pas sciemment d'informations personnelles provenant d'enfants. Si vous pensez que des informations d'un enfant ont été collectées par erreur, veuillez nous contacter immédiatement et nous supprimerons ces informations.\n\n8. Modifications de cette politique de confidentialité\nNous pouvons mettre à jour cette politique de confidentialité de temps à autre. La version la plus récente sera toujours disponible dans l'application et sur notre site web. Toute modification importante sera communiquée via des mises à jour de l'application ou des notifications.\n\n9. Contactez-nous\nSi vous avez des questions ou des préoccupations concernant cette politique de confidentialité ou nos pratiques en matière de données, veuillez nous contacter :\nE-mail : yuki22683@gmail.com\n\nEn utilisant Arithmetic Training, vous acceptez les termes décrits dans cette politique de confidentialité. Merci d'avoir choisi notre application !"
    },
    "it": {
      "privacy_policy_body":
      "\nData di entrata in vigore: 13 maggio 2025\n\nBenvenuti in Arithmetic Training. Questa applicazione 3D è sviluppata e gestita da yt-Studio ( \"noi \",  \"ci \" o  \"nostro \"). Rispettiamo la vostra privacy e ci impegniamo a proteggere le vostre informazioni personali. Questa Informativa sulla Privacy spiega come raccogliamo, utilizziamo e condividiamo le informazioni quando utilizzate la nostra applicazione Arithmetic Training su Meta Quest.\n\n1. Informazioni che raccogliamo\nInformazioni fornite direttamente\nArithmetic Training non richiede la registrazione dell'utente, quindi non raccogliamo informazioni personali identificabili (PII) come nome, indirizzo email o dettagli di contatto.\nInformazioni sul dispositivo\nPossiamo raccogliere informazioni non personalmente identificabili sul dispositivo, come:\n･ Modello del dispositivo\n･ Versione del sistema operativo\n･ Stato della connessione\nQueste informazioni vengono raccolte esclusivamente per garantire il funzionamento e le prestazioni dell'applicazione.\nDati sull'utilizzo dell'applicazione\nNon raccogliamo dati sull'utilizzo dell'applicazione che possano essere utilizzati per identificare individui.\n\n2. Come utilizziamo le informazioni\nUtilizziamo le informazioni raccolte per i seguenti scopi:\n･ Fornire, mantenere e migliorare Arithmetic Training (ad esempio, correzioni di bug, miglioramenti delle prestazioni).\n･ Rispondere alle richieste di supporto degli utenti e risolvere problemi tecnici.\n･ Inviare notifiche importanti sull'app (ad esempio, aggiornamenti, modifiche alle politiche).\n\n3. Condivisione delle informazioni\nNon vendiamo né cediamo le vostre informazioni personali a terzi.\nPossiamo condividere informazioni non personalmente identificabili con fornitori di servizi solo se necessario per il funzionamento e la manutenzione delle funzionalità dell'app.\n\n4. Sicurezza delle informazioni\nImplementiamo misure tecniche e organizzative ragionevoli e appropriate per proteggere le vostre informazioni da accessi non autorizzati, divulgazioni o utilizzi impropri. Tuttavia, nessun metodo di trasmissione su Internet è sicuro al 100%.\n\n5. I vostri diritti e scelte\nAvete il diritto di:\n･ Accedere ai dati che potremmo aver raccolto (se presenti).\n･ Richiedere la correzione di dati inesatti.\n･ Richiedere la cancellazione dei vostri dati.\nPer richiedere l'accesso, la correzione o la cancellazione dei vostri dati, contattateci all'indirizzo email fornito di seguito. Risponderemo entro 30 giorni in conformità con le leggi sulla privacy applicabili.\n\n6. Processo di cancellazione dei dati\nSe desiderate che cancelliamo eventuali dati raccolti tramite l'applicazione Arithmetic Training, inviateci un'email a: yuki22683@gmail.com (mailto:yuki22683@gmail.com)\nIncludete nell'oggetto: Richiesta di cancellazione dati - Arithmetic Training\nDescrivete la vostra richiesta e fornite eventuali informazioni identificative necessarie per localizzare i vostri dati (se presenti).\nNota: Poiché non raccogliamo PII per impostazione predefinita, potremmo non essere in grado di associare i dati a utenti specifici, ma faremo ogni sforzo per soddisfare la vostra richiesta.\n\n7. Privacy dei minori\nArithmetic Training non è destinato a bambini di età inferiore ai 13 anni. Non raccogliamo consapevolmente informazioni personali da bambini. Se ritenete che le informazioni di un minore siano state raccolte involontariamente, contattateci immediatamente e provvederemo a cancellare tali informazioni.\n\n8. Modifiche a questa Informativa sulla Privacy\nPotremmo aggiornare questa Informativa sulla Privacy di tanto in tanto. La versione più recente sarà sempre disponibile all'interno dell'app e sul nostro sito web. Eventuali modifiche sostanziali saranno comunicate tramite aggiornamenti dell'app o notifiche.\n\n9. Contattaci\nSe avete domande o dubbi su questa Informativa sulla Privacy o sulle nostre pratiche relative ai dati, contattateci:\nEmail: yuki22683@gmail.com\n\nUtilizzando Arithmetic Training, accettate i termini descritti in questa Informativa sulla Privacy. Grazie per aver scelto la nostra app!"
    },
    "ko": {
      "privacy_policy_body":
      "\n효력 발생일: 2025년 5월 13일\n\n산수 훈련에 오신 것을 환영합니다.\n본 3D 애플리케이션은 yt-Studio(이하 “당사”, “저희” 또는 “우리”)에서 개발 및 운영합니다. 당사는 귀하의 개인정보를 존중하며 귀하의 개인정보 보호에 최선을 다하고 있습니다. 본 개인정보 처리방침은 귀하가 Meta Quest에서 산수 훈련 애플리케이션을 사용할 때 당사가 정보를 수집, 사용 및 공유하는 방식에 대해 설명합니다.\n\n1. 수집하는 정보\n직접 제공한 정보\n산수 훈련은 사용자 등록을 요구하지 않으므로, 이름, 이메일 주소, 연락처 등 개인 식별 정보(PII)를 수집하지 않습니다.\n기기 정보\n당사는 다음과 같은 비개인 식별 기기 정보를 수집할 수 있습니다:\n･기기 모델\n･운영 체제 버전\n･연결 상태\n이 정보는 애플리케이션의 기능 및 성능 보장을 위해 수집됩니다.\n애플리케이션 사용 데이터\n당사는 개인을 식별할 수 있는 애플리케이션 사용 데이터를 수집하지 않습니다.\n\n2. 정보 사용 방식\n당사는 수집된 정보를 다음과 같은 목적으로 사용합니다:\n･산수 훈련을 제공, 유지 및 개선(예: 버그 수정, 성능 향상).\n･사용자 지원 요청에 응답하고 기술적 문제를 해결.\n･앱에 대한 중요한 알림 전송(예: 업데이트, 정책 변경).\n\n3. 정보 공유\n당사는 귀하의 개인정보를 제3자에게 판매하거나 대여하지 않습니다.\n애플리케이션의 기능 운영 및 유지에 필요한 경우에만 비개인 식별 정보를 서비스 제공업체와 공유할 수 있습니다.\n\n4. 정보 보안\n당사는 귀하의 정보를 무단 접근, 공개 또는 오용으로부터 보호하기 위해 합리적이고 적절한 기술적 및 조직적 조치를 시행합니다. 그러나 인터넷을 통한 전송 방식은 100% 안전하지 않습니다.\n\n5. 귀하의 권리 및 선택\n귀하는 다음과 같은 권리를 가집니다:\n･당사가 수집한 데이터(있는 경우)에 접근.\n･부정확한 데이터의 정정을 요청.\n･데이터 삭제를 요청.\n데이터 접근, 정정 또는 삭제를 요청하려면 아래 제공된 이메일 주소로 연락해 주세요. 당사는 관련 개인정보 보호법에 따라 30일 이내에 응답합니다.\n\n6. 데이터 삭제 절차\n산수 훈련 애플리케이션을 통해 수집된 데이터를 삭제하고 싶으신 경우, 아래 이메일로 연락해 주세요:\n이메일: yuki22683@gmail.com\n제목: 산수 훈련 데이터 삭제 요청\n요청 내용과 데이터 식별에 필요한 정보(있는 경우)를 설명해 주세요.\n참고: 당사는 기본적으로 PII를 수집하지 않으므로 특정 사용자와 데이터를 연관 짓지 못할 수 있지만, 귀하의 요청을 수용하기 위해 최선을 다할 것입니다.\n\n7. 어린이 개인정보\n산수 훈련은 13세 미만 어린이를 대상으로 하지 않습니다. 당사는 어린이의 개인정보를 고의로 수집하지 않습니다. 어린이의 정보가 의도치 않게 수집되었다고 판단되는 경우, 즉시 연락해 주시면 해당 정보를 삭제하겠습니다.\n\n8. 본 개인정보 처리방침의 변경\n당사는 본 개인정보 처리방침을 수시로 업데이트할 수 있습니다. 최신 버전은 항상 앱 내 및 당사 웹사이트에서 확인할 수 있습니다. 중요한 변경 사항은 앱 업데이트 또는 알림을 통해 안내됩니다.\n\n9. 문의처\n본 개인정보 처리방침 또는 당사의 데이터 처리 관행에 대해 궁금한 점이나 우려 사항이 있는 경우, 아래로 연락해 주세요:\n이메일: yuki22683@gmail.com\n\n산수 훈련을 사용함으로써 귀하는 본 개인정보 처리방침에 명시된 조건에 동의하는 것입니다. 저희 앱을 선택해 주셔서 감사합니다!"
    },
    "no": {
      "privacy_policy_body":
      "\nEffektiv dato: 13. mai 2025\n\nVelkommen til Arithmetic Training. Denne 3D-applikasjonen er utviklet og driftet av yt-Studio (\"vi,\" \"oss,\" eller \"vår\"). Vi respekterer ditt personvern og er forpliktet til å beskytte dine personopplysninger. Denne personvernerklæringen forklarer hvordan vi samler inn, bruker og deler informasjon når du bruker vår Arithmetic Training-applikasjon på Meta Quest.\n\n1. Informasjon vi samler inn\nInformasjon du gir direkte\nArithmetic Training krever ikke brukerregistrering, så vi samler ikke inn personlig identifiserbar informasjon (PII) som navn, e-postadresse eller kontaktdetaljer.\nEnhetsinformasjon\nVi kan samle inn ikke-personlig identifiserbar enhetsinformasjon som:\n･ Enhetsmodell\n･ Operativsystemversjon\n･ Tilkoblingsstatus\nDenne informasjonen samles inn utelukkende for å sikre applikasjonens funksjonalitet og ytelse.\nBruksdata for applikasjonen\nVi samler ikke inn bruksdata som kan brukes til å identifisere enkeltpersoner.\n\n2. Hvordan vi bruker informasjonen\nVi bruker innsamlet informasjon til følgende formål:\n･ Å tilby, vedlikeholde og forbedre Arithmetic Training (f.eks. feilrettinger, ytelsesforbedringer).\n･ Å svare på brukerstøtteforespørsler og løse tekniske problemer.\n･ Å sende viktige varsler om appen (f.eks. oppdateringer, endringer i retningslinjer).\n\n3. Deling av informasjon\nVi selger eller leier ikke ut dine personopplysninger til tredjeparter.\nVi kan dele ikke-personlig identifiserbar informasjon med tjenesteleverandører kun når det er nødvendig for å drive og vedlikeholde appens funksjonalitet.\n\n4. Informasjonssikkerhet\nVi implementerer rimelige og passende tekniske og organisatoriske tiltak for å beskytte informasjonen din mot uautorisert tilgang, avsløring eller misbruk. Ingen metode for overføring over internett er imidlertid 100 % sikker.\n\n5. Dine rettigheter og valg\nDu har rett til å:\n･ Få tilgang til dataene vi eventuelt har samlet inn.\n･ Be om korrigering av unøyaktige data.\n･ Be om sletting av dine data.\nFor å be om tilgang, korrigering eller sletting av dine data, vennligst kontakt oss på e-postadressen oppgitt nedenfor. Vi vil svare innen 30 dager i samsvar med gjeldende personvernlovgivning.\n\n6. Prosess for sletting av data\nHvis du ønsker at vi sletter data som eventuelt er samlet inn gjennom Arithmetic Training-applikasjonen, vennligst send oss en e-post til: yuki22683@gmail.com\nInkluder emnelinjen: Forespørsel om sletting av data - Arithmetic Training\nVennligst beskriv forespørselen din og eventuell identifiserende informasjon som er nødvendig for å finne dine data (hvis noen).\nMerknad: Siden vi ikke samler inn PII som standard, kan vi kanskje ikke knytte data til spesifikke brukere, men vi vil gjøre vårt ytterste for å imøtekomme forespørselen din.\n\n7. Barns personvern\nArithmetic Training er ikke ment for barn under 13 år. Vi samler ikke bevisst inn personopplysninger fra barn. Hvis du tror at et barns informasjon har blitt samlet inn utilsiktet, vennligst kontakt oss umiddelbart, så vil vi slette slik informasjon.\n\n8. Endringer i denne personvernerklæringen\nVi kan oppdatere denne personvernerklæringen fra tid til annen. Den nyeste versjonen vil alltid være tilgjengelig i appen og på vår nettside. Vesentlige endringer vil bli kommunisert gjennom appoppdateringer eller varsler.\n\n9. Kontakt oss\nHvis du har spørsmål eller bekymringer angående denne personvernerklæringen eller våre datapraksiser, vennligst kontakt oss:\nE-post: yuki22683@gmail.com\n\nVed å bruke Arithmetic Training godtar du vilkårene beskrevet i denne personvernerklæringen. Takk for at du valgte vår app!"
    },
    "pl": {
      "privacy_policy_body":
      "\nData wejścia w życie: 13 maja 2025 r.\n\nWitamy w aplikacji Arithmetic Training. Ta aplikacja 3D jest rozwijana i obsługiwana przez yt-Studio („my”, „nas” lub „nasz”). Szanujemy Twoją prywatność i zobowiązujemy się do ochrony Twoich danych osobowych. Niniejsza Polityka Prywatności wyjaśnia, jak zbieramy, wykorzystujemy i udostępniamy informacje, gdy korzystasz z naszej aplikacji Arithmetic Training na platformie Meta Quest.\n\n1. Informacje, które zbieramy\nInformacje dostarczane bezpośrednio przez użytkownika\nAplikacja Arithmetic Training nie wymaga rejestracji użytkownika, dlatego nie zbieramy danych osobowych (PII), takich jak imię i nazwisko, adres e-mail czy dane kontaktowe.\nInformacje o urządzeniu\nMożemy zbierać nieosobowe informacje o urządzeniu, takie jak:\n･ Model urządzenia\n･ Wersja systemu operacyjnego\n･ Status połączenia\nInformacje te są zbierane wyłącznie w celu zapewnienia funkcjonalności i wydajności aplikacji.\nDane dotyczące użytkowania aplikacji\nNie zbieramy żadnych danych dotyczących użytkowania aplikacji, które mogłyby służyć do identyfikacji osób.\n\n2. Jak wykorzystujemy informacje\nZebrane informacje wykorzystujemy w następujących celach:\n･ Zapewnienie, utrzymanie i ulepszanie aplikacji Arithmetic Training (np. naprawa błędów, poprawa wydajności).\n･ Odpowiadanie na prośby o wsparcie użytkownika i rozwiązywanie problemów technicznych.\n･ Wysyłanie ważnych powiadomień dotyczących aplikacji (np. aktualizacje, zmiany w polityce).\n\n3. Udostępnianie informacji\nNie sprzedajemy ani nie wynajmujemy Twoich danych osobowych stronom trzecim.\nNieosobowe informacje możemy udostępniać dostawcom usług tylko w zakresie niezbędnym do obsługi i utrzymania funkcjonalności aplikacji.\n\n4. Bezpieczeństwo informacji\nWdrożyliśmy rozsądne i odpowiednie środki techniczne oraz organizacyjne, aby chronić Twoje informacje przed nieautoryzowanym dostępem, ujawnieniem lub niewłaściwym użyciem. Jednak żaden sposób transmisji danych przez Internet nie jest w 100% bezpieczny.\n\n5. Twoje prawa i wybory\nMasz prawo do:\n･ Dostępu do danych, które mogliśmy zebrać (jeśli takie istnieją).\n･ Żądania korekty niedokładnych danych.\n･ Żądania usunięcia Twoich danych.\nAby zażądać dostępu, korekty lub usunięcia danych, skontaktuj się z nami pod adresem e-mail podanym poniżej. Odpowiemy w ciągu 30 dni, zgodnie z obowiązującymi przepisami dotyczącymi ochrony danych.\n\n6. Proces usuwania danych\nJeśli chcesz, abyśmy usunęli jakiekolwiek dane, które mogły zostać zebrane przez aplikację Arithmetic Training, skontaktuj się z nami pod adresem: yuki22683@gmail.com\nW temacie wiadomości wpisz: Żądanie usunięcia danych - Arithmetic Training\nOpisz swoje żądanie i podaj wszelkie informacje identyfikujące, które mogą być potrzebne do zlokalizowania Twoich danych (jeśli takie istnieją).\nUwaga: Ponieważ domyślnie nie zbieramy danych osobowych, możemy nie być w stanie powiązać danych z konkretnymi użytkownikami, ale dołożymy wszelkich starań, aby spełnić Twoje żądanie.\n\n7. Prywatność dzieci\nAplikacja Arithmetic Training nie jest przeznaczona dla dzieci poniżej 13 roku życia. Nie zbieramy świadomie danych osobowych od dzieci. Jeśli uważasz, że dane dziecka zostały zebrane przypadkowo, skontaktuj się z nami niezwłocznie, a my usuniemy takie informacje.\n\n8. Zmiany w niniejszej Polityce Prywatności\nOd czasu do czasu możemy aktualizować niniejszą Politykę Prywatności. Najnowsza wersja będzie zawsze dostępna w aplikacji oraz na naszej stronie internetowej. Wszelkie istotne zmiany będą komunikowane za pośrednictwem aktualizacji aplikacji lub powiadomień.\n\n9. Kontakt z nami\nJeśli masz jakiekolwiek pytania lub wątpliwości dotyczące niniejszej Polityki Prywatności lub naszych praktyk dotyczących danych, skontaktuj się z nami:\nE-mail: yuki22683@gmail.com\n\nKorzystając z aplikacji Arithmetic Training, zgadzasz się na warunki określone w niniejszej Polityce Prywatności. Dziękujemy za wybór naszej aplikacji!"
    },
    "pt": {
      "privacy_policy_body":
      "\nData de Vigência: 13 de maio de 2025\n\nBem-vindo ao Arithmetic Training. Este aplicativo em 3D é desenvolvido e operado pela yt-Studio (“nós”, “nos” ou “nosso”). Respeitamos sua privacidade e estamos comprometidos em proteger suas informações pessoais. Esta Política de Privacidade explica como coletamos, usamos e compartilhamos informações quando você utiliza nosso aplicativo Arithmetic Training no Meta Quest.\n\n1. Informações que Coletamos\nInformações Fornecidas Diretamente por Você\nO Arithmetic Training não exige registro de usuário, portanto, não coletamos informações pessoalmente identificáveis (PII), como seu nome, endereço de e-mail ou detalhes de contato.\nInformações do Dispositivo\nPodemos coletar informações não pessoalmente identificáveis do dispositivo, como:\n･Modelo do dispositivo\n･Versão do sistema operacional\n･Status de conexão\nEssas informações são coletadas exclusivamente para garantir a funcionalidade e o desempenho do aplicativo.\nDados de Uso do Aplicativo\nNão coletamos dados de uso do aplicativo que possam ser usados para identificar indivíduos.\n\n2. Como Usamos as Informações\nUtilizamos as informações coletadas para os seguintes propósitos:\n･Fornecer, manter e melhorar o Arithmetic Training (por exemplo, correções de bugs, melhorias de desempenho).\n･Responder a solicitações de suporte do usuário e resolver problemas técnicos.\n･Enviar notificações importantes sobre o aplicativo (por exemplo, atualizações, mudanças de política).\n\n3. Compartilhamento de Informações\nNão vendemos ou alugamos suas informações pessoais a terceiros.\nPodemos compartilhar informações não pessoalmente identificáveis com provedores de serviços apenas conforme necessário para operar e manter a funcionalidade do aplicativo.\n\n4. Segurança das Informações\nImplementamos medidas técnicas e organizacionais razoáveis e apropriadas para proteger suas informações contra acesso, divulgação ou uso indevido não autorizado. No entanto, nenhum método de transmissão pela Internet é 100% seguro.\n\n5. Seus Direitos e Escolhas\nVocê tem o direito de:\n･Acessar os dados que podemos ter coletado (se houver).\n･Solicitar a correção de dados imprecisos.\n･Solicitar a exclusão de seus dados.\nPara solicitar acesso, correção ou exclusão de seus dados, entre em contato conosco pelo e-mail fornecido abaixo. Responderemos dentro de 30 dias, conforme as leis de privacidade aplicáveis.\n\n6. Processo de Exclusão de Dados\nSe desejar que excluamos quaisquer dados que possam ter sido coletados pelo aplicativo Arithmetic Training, envie um e-mail para: yuki22683@gmail.com (mailto:yuki22683@gmail.com)\nInclua a linha de assunto: Solicitação de Exclusão de Dados - Arithmetic Training\nDescreva sua solicitação e quaisquer informações de identificação necessárias para localizar seus dados (se houver).\nNota: Como não coletamos PII por padrão, podemos não conseguir associar dados a usuários específicos, mas faremos todos os esforços para atender à sua solicitação.\n\n7. Privacidade de Crianças\nO Arithmetic Training não é destinado a crianças menores de 13 anos. Não coletamos intencionalmente informações pessoais de crianças. Se você acredita que informações de uma criança foram coletadas acidentalmente, entre em contato conosco imediatamente e excluiremos essas informações.\n\n8. Alterações a Esta Política de Privacidade\nPodemos atualizar esta Política de Privacidade de tempos em tempos. A versão mais recente estará sempre disponível no aplicativo e em nosso site. Quaisquer alterações significativas serão comunicadas por meio de atualizações do aplicativo ou notificações.\n\n9. Contato\nSe você tiver dúvidas ou preocupações sobre esta Política de Privacidade ou nossas práticas de dados, entre em contato conosco:\nE-mail: yuki22683@gmail.com\n\nAo usar o Arithmetic Training, você concorda com os termos descritos nesta Política de Privacidade. Obrigado por escolher nosso aplicativo!"
  },
    "ro": {
      "privacy_policy_body":
      "\nData intrării în vigoare: 13 mai 2025\n\nBine ați venit la Arithmetic Training. Această aplicație 3D este dezvoltată și operată de yt-Studio („noi”, „ne”, sau „al nostru”). Respectăm confidențialitatea dumneavoastră și ne angajăm să protejăm informațiile personale. Această Politică de confidențialitate explică modul în care colectăm, utilizăm și partajăm informațiile atunci când utilizați aplicația Arithmetic Training pe Meta Quest.\n\n1. Informațiile pe care le colectăm\nInformații furnizate direct de dumneavoastră\nArithmetic Training nu necesită înregistrarea utilizatorului, astfel încât nu colectăm informații de identificare personală (PII), cum ar fi numele, adresa de e-mail sau detaliile de contact.\nInformații despre dispozitiv\nPutem colecta informații despre dispozitiv care nu permit identificarea personală, cum ar fi:\n･Modelul dispozitivului\n･Versiunea sistemului de operare\n･Starea conexiunii\nAceste informații sunt colectate exclusiv pentru a asigura funcționalitatea și performanța aplicației.\nDate privind utilizarea aplicației\nNu colectăm date privind utilizarea aplicației care pot fi folosite pentru a identifica persoane.\n\n2. Cum utilizăm informațiile\nUtilizăm informațiile colectate în următoarele scopuri:\n･Pentru a furniza, menține și îmbunătăți Arithmetic Training (de exemplu, remedierea erorilor, îmbunătățirea performanței).\n･Pentru a răspunde cererilor de asistență ale utilizatorilor și a rezolva probleme tehnice.\n･Pentru a trimite notificări importante despre aplicație (de exemplu, actualizări, modificări ale politicii).\n\n3. Partajarea informațiilor\nNu vindem și nu închiriem informațiile dumneavoastră personale către terți.\nPutem partaja informații care nu permit identificarea personală cu furnizorii de servicii doar în măsura necesară pentru a opera și menține funcționalitatea aplicației.\n\n4. Securitatea informațiilor\nImplementăm măsuri tehnice și organizatorice rezonabile și adecvate pentru a vă proteja informațiile împotriva accesului, dezvăluirii sau utilizării neautorizate. Cu toate acestea, nicio metodă de transmitere prin internet nu este 100% sigură.\n\n5. Drepturile și opțiunile dumneavoastră\nAveți dreptul de a:\n･Accesa datele pe care le-am colectat (dacă există).\n･Solicita corectarea datelor inexacte.\n･Solicita ștergerea datelor dumneavoastră.\nPentru a solicita accesul, corectarea sau ștergerea datelor dumneavoastră, vă rugăm să ne contactați la adresa de e-mail furnizată mai jos. Vom răspunde în termen de 30 de zile, în conformitate cu legile aplicabile privind confidențialitatea.\n\n6. Procesul de ștergere a datelor\nDacă doriți să ștergem orice date care ar fi putut fi colectate prin aplicația Arithmetic Training, vă rugăm să ne trimiteți un e-mail la: yuki22683@gmail.com\nIncludeți subiectul: Cerere de ștergere a datelor - Arithmetic Training\nVă rugăm să descrieți cererea dumneavoastră și orice informații de identificare necesare pentru a localiza datele (dacă există).\nNotă: Deoarece nu colectăm implicit PII, este posibil să nu putem asocia datele cu utilizatori specifici, dar vom depune toate eforturile pentru a vă satisface cererea.\n\n7. Confidențialitatea copiilor\nArithmetic Training nu este destinat copiilor sub 13 ani. Nu colectăm în mod conștient informații personale de la copii. Dacă credeți că informațiile unui copil au fost colectate neintenționat, vă rugăm să ne contactați imediat, iar noi vom șterge aceste informații.\n\n8. Modificări ale acestei Politici de confidențialitate\nPutem actualiza această Politică de confidențialitate din când în când. Cea mai recentă versiune va fi întotdeauna disponibilă în aplicație și pe site-ul nostru web. Orice modificări semnificative vor fi comunicate prin actualizări ale aplicației sau notificări.\n\n9. Contactați-ne\nDacă aveți întrebări sau preocupări cu privire la această Politică de confidențialitate sau practicile noastre privind datele, vă rugăm să ne contactați:\nE-mail: yuki22683@gmail.com\n\nPrin utilizarea Arithmetic Training, sunteți de acord cu termenii descriși în această Politică de confidențialitate. Vă mulțumim că ați ales aplicația noastră!"
    },
    "ru": { 
      "privacy_policy_body":
      "\nДата вступления в силу: 13 мая 2025 года\n\nДобро пожаловать в Arithmetic Training. Это 3D-приложение разработано и управляется yt-Studio («мы», «нас» или «наш»). Мы уважаем вашу конфиденциальность и стремимся защищать ваши личные данные. Настоящая Политика конфиденциальности объясняет, как мы собираем, используем и передаем информацию, когда вы используете наше приложение Arithmetic Training на платформе Meta Quest.\n\n1. Информация, которую мы собираем\nИнформация, предоставляемая вами напрямую\nArithmetic Training не требует регистрации пользователей, поэтому мы не собираем персонально идентифицируемую информацию (PII), такую как ваше имя, адрес электронной почты или контактные данные.\nИнформация об устройстве\nМы можем собирать неперсонализированную информацию об устройстве, такую как:\n･Модель устройства\n･Версия операционной системы\n･Статус подключения\nЭта информация собирается исключительно для обеспечения функциональности и производительности приложения.\nДанные об использовании приложения\nМы не собираем данные об использовании приложения, которые могут быть использованы для идентификации личности.\n\n2. Как мы используем информацию\nМы используем собранную информацию для следующих целей:\n･Для предоставления, поддержки и улучшения Arithmetic Training (например, исправление ошибок, улучшение производительности).\n･Для ответа на запросы пользователей в службу поддержки и решения технических проблем.\n･Для отправки важных уведомлений о приложении (например, об обновлениях, изменениях в политике).\n\n3. Передача информации\nМы не продаем и не сдаем в аренду ваши личные данные третьим лицам.\nМы можем передавать неперсонализированную информацию поставщикам услуг только в той мере, в какой это необходимо для работы и поддержки функциональности приложения.\n\n4. Безопасность информации\nМы применяем разумные и соответствующие технические и организационные меры для защиты вашей информации от несанкционированного доступа, раскрытия или неправомерного использования. Однако ни один способ передачи данных через Интернет не является абсолютно безопасным.\n\n5. Ваши права и возможности\nУ вас есть право:\n･Получить доступ к данным, которые мы могли собрать (если таковые имеются).\n･Запросить исправление неточных данных.\n･Запросить удаление ваших данных.\nЧтобы запросить доступ, исправление или удаление ваших данных, пожалуйста, свяжитесь с нами по адресу электронной почты, указанному ниже. Мы ответим в течение 30 дней в соответствии с действующим законодательством о конфиденциальности.\n\n6. Процесс удаления данных\nЕсли вы хотите, чтобы мы удалили какие-либо данные, которые могли быть собраны через приложение Arithmetic Training, пожалуйста, отправьте нам письмо по адресу: yuki22683@gmail.com\nУкажите тему: Запрос на удаление данных — Arithmetic Training\nПожалуйста, опишите ваш запрос и предоставьте любую идентифицирующую информацию, необходимую для поиска ваших данных (если таковые имеются).\nПримечание: Поскольку мы по умолчанию не собираем PII, мы можем не иметь возможности связать данные с конкретными пользователями, но мы приложим все усилия для удовлетворения вашего запроса.\n\n7. Конфиденциальность детей\nArithmetic Training не предназначено для детей младше 13 лет. Мы не собираем сознательно личную информацию от детей. Если вы считаете, что информация о ребенке была собрана непреднамеренно, пожалуйста, немедленно свяжитесь с нами, и мы удалим такую информацию.\n\n8. Изменения в настоящей Политике конфиденциальности\nМы можем время от времени обновлять настоящую Политику конфиденциальности. Самая актуальная версия всегда будет доступна в приложении и на нашем веб-сайте. О любых существенных изменениях будет сообщено через обновления приложения или уведомления.\n\n9. Свяжитесь с нами\nЕсли у вас есть вопросы или опасения по поводу настоящей Политики конфиденциальности или наших методов работы с данными, пожалуйста, свяжитесь с нами:\nЭлектронная почта: yuki22683@gmail.com\n\nИспользуя Arithmetic Training, вы соглашаетесь с условиями, изложенными в настоящей Политике конфиденциальности. Спасибо, что выбрали наше приложение!"
    },
    "es": {
      "privacy_policy_body":
      "\nFecha de entrada en vigor: 13 de mayo de 2025\n\nBienvenido a Arithmetic Training. Esta aplicación en 3D es desarrollada y operada por yt-Studio ( \"nosotros \",  \"nos \" o  \"nuestro \"). Respetamos su privacidad y estamos comprometidos con proteger su información personal. Esta Política de Privacidad explica cómo recopilamos, usamos y compartimos información cuando utiliza nuestra aplicación Arithmetic Training en Meta Quest.\n\n1. Información que recopilamos\nInformación proporcionada directamente por usted\nArithmetic Training no requiere registro de usuarios, por lo que no recopilamos información de identificación personal (PII), como su nombre, dirección de correo electrónico o detalles de contacto.\nInformación del dispositivo\nPodemos recopilar información del dispositivo que no permite la identificación personal, como:\n･Modelo del dispositivo\n･Versión del sistema operativo\n･Estado de la conexión\nEsta información se recopila únicamente para garantizar la funcionalidad y el rendimiento de la aplicación.\nDatos de uso de la aplicación\nNo recopilamos datos de uso de la aplicación que puedan usarse para identificar a personas.\n\n2. Cómo usamos la información\nUtilizamos la información recopilada para los siguientes fines:\n･Proporcionar, mantener y mejorar Arithmetic Training (por ejemplo, corrección de errores, mejoras de rendimiento).\n･Responder a las solicitudes de soporte de los usuarios y resolver problemas técnicos.\n･Enviar notificaciones importantes sobre la aplicación (por ejemplo, actualizaciones, cambios de política).\n\n3. Compartir información\nNo vendemos ni alquilamos su información personal a terceros.\nPodemos compartir información que no permite la identificación personal con proveedores de servicios solo en la medida necesaria para operar y mantener la funcionalidad de la aplicación.\n\n4. Seguridad de la información\nImplementamos medidas técnicas y organizativas razonables y apropiadas para proteger su información contra el acceso, la divulgación o el uso indebido no autorizados. Sin embargo, ningún método de transmisión por Internet es 100% seguro.\n\n5. Sus derechos y opciones\nUsted tiene derecho a:\n･Acceder a los datos que hayamos recopilado (si los hay).\n･Solicitar la corrección de datos inexactos.\n･Solicitar la eliminación de sus datos.\nPara solicitar acceso, corrección o eliminación de sus datos, contáctenos en la dirección de correo electrónico proporcionada a continuación. Responderemos en un plazo de 30 días, de acuerdo con las leyes de privacidad aplicables.\n\n6. Proceso de eliminación de datos\nSi desea que eliminemos cualquier dato que pueda haber sido recopilado a través de la aplicación Arithmetic Training, envíenos un correo electrónico a: yuki22683@gmail.com\nIncluya el asunto: Solicitud de eliminación de datos - Arithmetic Training\nPor favor, describa su solicitud y cualquier información de identificación necesaria para localizar sus datos (si los hay).\nNota: Dado que no recopilamos PII por defecto, es posible que no podamos asociar los datos con usuarios específicos, pero haremos todo lo posible para atender su solicitud.\n\n7. Privacidad de los menores\nArithmetic Training no está destinado a niños menores de 13 años. No recopilamos conscientemente información personal de niños. Si cree que se ha recopilado información de un menor de forma no intencionada, contáctenos de inmediato y eliminaremos dicha información.\n\n8. Cambios en esta Política de Privacidad\nPodemos actualizar esta Política de Privacidad de vez en cuando. La versión más reciente estará siempre disponible en la aplicación y en nuestro sitio web. Cualquier cambio significativo será comunicado a través de actualizaciones de la aplicación o notificaciones.\n\n9. Contáctenos\nSi tiene alguna pregunta o inquietud sobre esta Política de Privacidad o nuestras prácticas de datos, contáctenos:\nCorreo electrónico: yuki22683@gmail.com\n\nAl usar Arithmetic Training, usted acepta los términos descritos en esta Política de Privacidad. ¡Gracias por elegir nuestra aplicación!"
    },
    "sv": {
      "privacy_policy_body":
      "\nIkraftträdandedatum: 13 maj 2025\n\nVälkommen till Arithmetic Training. Denna 3D-applikation är utvecklad och drivs av yt-Studio (”vi”, ”oss” eller ”vår”). Vi respekterar din integritet och är engagerade i att skydda dina personuppgifter. Denna integritetspolicy förklarar hur vi samlar in, använder och delar information när du använder vår applikation Arithmetic Training på Meta Quest.\n\n1. Information vi samlar in\nInformation du tillhandahåller direkt\nArithmetic Training kräver ingen användarregistrering, så vi samlar inte in personligt identifierbar information (PII) såsom ditt namn, e-postadress eller kontaktuppgifter.\nEnhetsinformation\nVi kan samla in icke-personligt identifierbar enhetsinformation, såsom:\n･Enhetsmodell\n･Version av operativsystemet\n･Anslutningsstatus\nDenna information samlas in enbart för att säkerställa applikationens funktionalitet och prestanda.\nData om applikationsanvändning\nVi samlar inte in några användningsdata för applikationen som kan användas för att identifiera individer.\n\n2. Hur vi använder informationen\nVi använder den insamlade informationen för följande ändamål:\n･Att tillhandahålla, underhålla och förbättra Arithmetic Training (t.ex. korrigering av buggar, prestandaförbättringar).\n･Att svara på användarsupportförfrågningar och lösa tekniska problem.\n･Att skicka viktiga meddelanden om applikationen (t.ex. uppdateringar, policyändringar).\n\n3. Delning av information\nVi säljer eller hyr inte ut din personliga information till tredje part.\nVi kan dela icke-personligt identifierbar information med tjänsteleverantörer endast i den utsträckning det är nödvändigt för att driva och underhålla applikationens funktionalitet.\n\n4. Informationssäkerhet\nVi implementerar rimliga och lämpliga tekniska och organisatoriska åtgärder för att skydda din information från obehörig åtkomst, avslöjande eller missbruk. Ingen metod för överföring över internet är dock 100 % säker.\n\n5. Dina rättigheter och valmöjligheter\nDu har rätt att:\n･Få tillgång till de uppgifter vi eventuellt har samlat in (om några).\n･Begära korrigering av felaktiga uppgifter.\n･Begära radering av dina uppgifter.\nFör att begära åtkomst, korrigering eller radering av dina uppgifter, kontakta oss på e-postadressen nedan. Vi kommer att svara inom 30 dagar i enlighet med tillämpliga dataskyddslagar.\n\n6. Process för radering av uppgifter\nOm du vill att vi raderar några uppgifter som kan ha samlats in via applikationen Arithmetic Training, vänligen skicka ett e-postmeddelande till: yuki22683@gmail.com\nAnge ämnesraden: Begäran om radering av uppgifter – Arithmetic Training\nVänligen beskriv din begäran och eventuell identifierande information som behövs för att lokalisera dina uppgifter (om några).\nNotera: Eftersom vi inte samlar in PII som standard kan vi kanske inte koppla uppgifter till specifika användare, men vi kommer att göra vårt bästa för att tillmötesgå din begäran.\n\n7. Barns integritet\nArithmetic Training är inte avsedd för barn under 13 år. Vi samlar inte medvetet in personuppgifter från barn. Om du anser att ett barns uppgifter har samlats in oavsiktligt, kontakta oss omedelbart så raderar vi dessa uppgifter.\n\n8. Ändringar i denna integritetspolicy\nVi kan uppdatera denna integritetspolicy från tid till annan. Den senaste versionen kommer alltid att finnas tillgänglig i applikationen och på vår webbplats. Eventuella väsentliga ändringar kommer att kommuniceras via applikationsuppdateringar eller meddelanden.\n\n9. Kontakta oss\nOm du har några frågor eller funderingar gällande denna integritetspolicy eller våra datarutiner, kontakta oss:\nE-post: yuki22683@gmail.com\n\nGenom att använda Arithmetic Training godkänner du villkoren i denna integritetspolicy. Tack för att du väljer vår applikation!"
    },
    "tr": {
      "privacy_policy_body":
      "\nYürürlük Tarihi: 13 Mayıs 2025\n\nArithmetic Training'e hoş geldiniz. Bu 3D uygulama, yt-Studio (“biz”, “bize” veya “bizim”) tarafından geliştirilmiş ve işletilmektedir. Gizliliğinize saygı duyuyor ve kişisel bilgilerinizi korumaya kararlıyız. Bu Gizlilik Politikası, Meta Quest üzerinde Arithmetic Training uygulamasını kullandığınızda bilgilerinizi nasıl topladığımızı, kullandığımızı ve paylaştığımızı açıklamaktadır.\n\n1. Topladığımız Bilgiler\nDoğrudan Sağladığınız Bilgiler\nArithmetic Training kullanıcı kaydı gerektirmez, bu nedenle adınız, e-posta adresiniz veya iletişim bilgileriniz gibi kişisel olarak tanımlanabilir bilgiler (PII) toplamıyoruz.\nCihaz Bilgileri\nKişisel olarak tanımlanabilir olmayan cihaz bilgilerini toplayabiliriz, örneğin:\n･Cihaz modeli\n･İşletim sistemi sürümü\n･Bağlantı durumu\nBu bilgiler yalnızca uygulamanın işlevselliğini ve performansını sağlamak için toplanır.\nUygulama Kullanım Verileri\nBireyleri tanımlamak için kullanılabilecek herhangi bir uygulama kullanım verisi toplamıyoruz.\n\n2. Bilgileri Nasıl Kullanıyoruz\nToplanan bilgileri aşağıdaki amaçlar için kullanıyoruz:\n･Arithmetic Training'i sağlamak, sürdürmek ve geliştirmek (örneğin, hata düzeltmeleri, performans iyileştirmeleri).\n･Kullanıcı destek taleplerine yanıt vermek ve teknik sorunları çözmek.\n･Uygulama hakkında önemli bildirimler göndermek (örneğin, güncellemeler, politika değişiklikleri).\n\n3. Bilgi Paylaşımı\nKişisel bilgilerinizi üçüncü taraflara satmıyor veya kiralamıyoruz.\nUygulamanın işlevselliğini işletmek ve sürdürmek için gerekli olduğu ölçüde, yalnızca kişisel olarak tanımlanabilir olmayan bilgileri hizmet sağlayıcılarla paylaşabiliriz.\n\n4. Bilgi Güvenliği\nBilgilerinizi yetkisiz erişim, ifşa veya kötüye kullanımdan korumak için makul ve uygun teknik ve organizasyonel önlemleri uyguluyoruz. Ancak, internet üzerinden hiçbir veri aktarım yöntemi %100 güvenli değildir.\n\n5. Haklarınız ve Seçenekleriniz\nAşağıdaki haklara sahipsiniz:\n･Topladığımız verilere (varsa) erişme.\n･Yanlış verilerin düzeltilmesini talep etme.\n･Verilerinizin silinmesini talep etme.\nVerilerinize erişim, düzeltme veya silme talebinde bulunmak için lütfen aşağıda belirtilen e-posta adresinden bizimle iletişime geçin. Uygulanabilir gizlilik yasalarına uygun olarak 30 gün içinde yanıt vereceğiz.\n\n6. Veri Silme Süreci\nArithmetic Training uygulaması aracılığıyla toplanmış olabilecek herhangi bir verinin silinmesini istiyorsanız, lütfen bize şu adresten e-posta gönderin: yuki22683@gmail.com\nE-posta konusuna: Veri Silme Talebi - Arithmetic Training yazın.\nLütfen talebinizi ve verilerinizi bulmak için gerekli olan herhangi bir tanımlayıcı bilgiyi (varsa) tarif edin.\nNot: Varsayılan olarak PII toplamamaktayız, bu nedenle verileri belirli kullanıcılarla ilişkilendiremeyebiliriz, ancak talebinizi yerine getirmek için elimizden gelen çabayı göstereceğiz.\n\n7. Çocukların Gizliliği\nArithmetic Training, 13 yaşından küçük çocuklar için tasarlanmamıştır. Çocuklardan bilerek kişisel bilgi toplamıyoruz. Bir çocuğun bilgilerinin yanlışlıkla toplandığını düşünüyorsanız, lütfen hemen bizimle iletişime geçin; bu bilgileri sileceğiz.\n\n8. Bu Gizlilik Politikasında Değişiklikler\nBu Gizlilik Politikasını zaman zaman güncelleyebiliriz. En güncel sürüm her zaman uygulama içinde ve web sitemizde mevcut olacaktır. Önemli değişiklikler uygulama güncellemeleri veya bildirimler yoluyla iletilecektir.\n\n9. Bize Ulaşın\nBu Gizlilik Politikası veya veri uygulamalarımız hakkında herhangi bir sorunuz veya endişeniz varsa, lütfen bizimle iletişime geçin:\nE-posta: yuki22683@gmail.com\n\nArithmetic Training'i kullanarak, bu Gizlilik Politikasında belirtilen şartları kabul etmiş olursunuz. Uygulamamızı seçtiğiniz için teşekkür ederiz!"
    },
    "zh-Hans": {
      "privacy_policy_body":
      "\n生效日期：2025年5月13日\n\n欢迎使用Arithmetic Training。这款3D应用程序由yt-Studio（“我们”或“我们的”）开发和运营。我们尊重您的隐私，并致力于保护您的个人信息。本隐私政策说明了您在使用Meta Quest上的Arithmetic Training应用程序时，我们如何收集、使用和分享信息。\n\n1. 我们收集的信息\n您直接提供的信息\nArithmetic Training无需用户注册，因此我们不会收集可识别个人身份的信息（PII），如您的姓名、电子邮件地址或联系方式。\n设备信息\n我们可能收集非个人身份识别的设备信息，例如：\n･设备型号\n･操作系统版本\n･连接状态\n这些信息仅用于确保应用程序的功能和性能。\n应用程序使用数据\n我们不会收集可用于识别个人的应用程序使用数据。\n\n2. 我们如何使用信息\n我们将收集的信息用于以下目的：\n･提供、维护和改进Arithmetic Training（例如，修复错误、提升性能）。\n･响应用户支持请求并解决技术问题。\n･发送有关应用程序的重要通知（例如，更新、政策变更）。\n\n3. 信息共享\n我们不会将您的个人信息出售或出租给第三方。\n我们可能仅在必要时与服务提供商共享非个人身份识别信息，以维护应用程序的功能。\n\n4. 信息安全\n我们采取合理且适当的技术和组织措施，以保护您的信息免受未经授权的访问、披露或滥用。然而，通过互联网传输的任何方法都不是100%安全的。\n\n5. 您的权利和选择\n您有以下权利：\n･访问我们可能收集的数据（如有）。\n･请求更正不准确的数据。\n･请求删除您的数据。\n如需请求访问、更正或删除您的数据，请通过下方提供的电子邮件地址联系我们。我们将在30天内根据适用的隐私法律做出回应。\n\n6. 数据删除流程\n如果您希望我们删除通过Arithmetic Training应用程序可能收集的任何数据，请通过电子邮件联系我们：\n电子邮件：yuki22683@gmail.com\n邮件主题：Arithmetic Training数据删除请求\n请描述您的请求以及查找您数据所需的任何识别信息（如有）。  \n注意：由于我们默认不收集PII，我们可能无法将数据与特定用户关联，但我们将尽一切努力满足您的请求。\n\n7. 儿童隐私\nArithmetic Training不适用于13岁以下的儿童。我们不会故意收集儿童的个人信息。如果您认为我们无意中收集了儿童的信息，请立即联系我们，我们将删除该信息。\n\n8. 本隐私政策的变更\n我们可能会不时更新本隐私政策。最新版本将始终在应用程序内和我们的网站上提供。任何重大变更将通过应用程序更新或通知进行沟通。\n\n9. 联系我们\n如果您对本隐私政策或我们的数据处理方式有任何疑问或担忧，请联系我们：\n电子邮件：yuki22683@gmail.com  \n\n使用Arithmetic Training即表示您同意本隐私政策中概述的条款。感谢您选择我们的应用程序！"
    },
    "zh-Hant": {
      "privacy_policy_body":
      "\n生效日期：2025年5月13日\n\n歡迎使用Arithmetic Training。這款3D應用程式由yt-Studio（「我們」或「我們的」）開發和營運。我們尊重您的隱私，並致力於保護您的個人資訊。本隱私政策說明了您在Meta Quest上使用Arithmetic Training應用程式時，我們如何收集、使用和分享資訊。\n\n1. 我們收集的資訊\n您直接提供的資訊\nArithmetic Training無需用戶註冊，因此我們不會收集可識別個人身份的資訊（PII），如您的姓名、電子郵件地址或聯繫方式。\n設備資訊\n我們可能收集非個人身份識別的設備資訊，例如：\n･設備型號\n･作業系統版本\n･連線狀態\n這些資訊僅用於確保應用程式的功能和性能。\n應用程式使用數據\n我們不會收集可用於識別個人的應用程式使用數據。\n\n2. 我們如何使用資訊\n我們將收集的資訊用於以下目的：\n･提供、維護和改進Arithmetic Training（例如，修復錯誤、提升性能）。\n･回應用戶支援請求並解決技術問題。\n･發送有關應用程式的重要通知（例如，更新、政策變更）。\n\n3. 資訊分享\n我們不會將您的個人資訊出售或出租給第三方。\n我們可能僅在必要時與服務提供商分享非個人身份識別資訊，以維護應用程式的功能。\n\n4. 資訊安全\n我們採取合理且適當的技術和組織措施，以保護您的資訊免受未經授權的存取、披露或濫用。然而，通過互聯網傳輸的任何方法都不是100%安全的。\n\n5. 您的權利與選擇\n您擁有以下權利：\n･存取我們可能收集的數據（如有）。\n･請求更正不準確的數據。\n･請求刪除您的數據。\n如需請求存取、更正或刪除您的數據，請通過下方提供的電子郵件地址聯繫我們。我們將在30天內根據適用的隱私法律做出回應。\n\n6. 數據刪除流程\n如果您希望我們刪除通過Arithmetic Training應用程式可能收集的任何數據，請通過電子郵件聯繫我們：\n電子郵件：yuki22683@gmail.com\n郵件主題：Arithmetic Training數據刪除請求\n請描述您的請求以及查找您數據所需的任何識別資訊（如有）。\n注意：由於我們默認不收集PII，我們可能無法將數據與特定用戶關聯，但我們將盡一切努力滿足您的請求。\n\n7. 兒童隱私\nArithmetic Training不適用於13歲以下的兒童。我們不會故意收集兒童的個人資訊。如果您認為我們無意中收集了兒童的資訊，請立即聯繫我們，我們將刪除該資訊。\n\n8. 本隱私政策的變更\n我們可能會不時更新本隱私政策。最新版本將始終在應用程式內和我們的網站上提供。任何重大變更將通過應用程式更新或通知進行溝通。\n\n9. 聯繫我們\n如果您對本隱私政策或我們的數據處理方式有任何疑問或疑慮，請聯繫我們：\n電子郵件：yuki22683@gmail.com\n\n使用Arithmetic Training即表示您同意本隱私政策中概述的條款。感謝您選擇我們的應用程式！"
    }
  }